/*
    В процессе написания лабораторной работы ознакомиться с алгоритмами
    сортировки и поиска в JavaScript.

    1.Напишите функцию, производящую сортировку в массиве студентов
    по средней оценке. Метод должен реализовывать сортировку Шелла.
*/

// let arr = [12,34,25,15,67,23,11,86];
// let arr = generateIntArray(10, 100);
// console.log("Исходный массив:", arr);
// console.log("Новый массив:", shellSort(arr));

let arr_students = [ 
    new Student("Васильев", "Василий", [
        new Mark("Физика", 4), 
        new Mark("Информатика", 5), 
        new Mark("Алгебра", 4),
        new Mark("Математический Анализ", 4),
        new Mark("Физкультура", 5)
    ]),
    new Student("Викторов", "Виктор", [
        new Mark("Физика", 4), 
        new Mark("Информатика", 4), 
        new Mark("Математический Анализ", 3),
        new Mark("Алгебра", 3),
        new Mark("Физкультура", 5)
    ]),
    new Student("Олегов", "Олег", [
        new Mark("Физика", 4), 
        new Mark("Информатика", 4), 
        new Mark("Математический Анализ", 3),
        new Mark("Алгебра", 3),
        new Mark("Физкультура", 5)
    ]),
    new Student("Степанов", "Степан", [
        new Mark("Физика", 5), 
        new Mark("Информатика", 5), 
        new Mark("Математический Анализ", 3),
        new Mark("Алгебра", 5),
        new Mark("Физкультура", 5)
    ]),
    new Student("Константинов", "Константин", [
        new Mark("Физика", 5), 
        new Mark("Информатика", 5), 
        new Mark("Математический Анализ", 5),
        new Mark("Алгебра", 4),
        new Mark("Физкультура", 5)
    ]),
    new Student("Данилов", "Данил", [
        new Mark("Физика", 5), 
        new Mark("Информатика", 5), 
        new Mark("Математический Анализ", 4),
        new Mark("Алгебра", 4),
        new Mark("Физкультура", 5)
    ]),
    new Student("Кириллов", "Кирилл", [
        new Mark("Физика", 4), 
        new Mark("Информатика", 4), 
        new Mark("Математический Анализ", 4),
        new Mark("Алгебра", 4),
        new Mark("Физкультура", 5)
    ]),
    new Student("Александров", "Александр", [
        new Mark("Физика", 4), 
        new Mark("Информатика", 4), 
        new Mark("Математический Анализ", 4),
        new Mark("Алгебра", 4),
        new Mark("Физкультура", 4)
    ]),
]

printMeanMark(arr_students);
console.log("-----------------------------------------------")
printMeanMark(shellForArrStudents(arr_students));